### <font color="brown">Pandas - Continued</font>

In [72]:
from pandas import Series
from pandas import DataFrame
import numpy as np
import pandas as pd

---

#### <font color="brown">Creating DataFrames - Continued</font>

**3. Creating a DataFrame from a 2D NumPy array**

In [73]:
rand2d = np.random.random((3,2))
randdf = DataFrame(rand2d)
randdf

          0         1
0  0.181026  0.847148
1  0.547391  0.332328
2  0.455161  0.883103

**Change index and column names**

In [74]:
randdf.index = ['one', 'two', 'three']
randdf.columns = ['first', 'second']
randdf

          first    second
one    0.181026  0.847148
two    0.547391  0.332328
three  0.455161  0.883103

**Or set them up at creation time**

In [75]:
randdf = DataFrame(rand2d, index=['one', 'two', 'three'],
                   columns = ['first', 'second'])
randdf

          first    second
one    0.181026  0.847148
two    0.547391  0.332328
three  0.455161  0.883103

---

#### <font color="brown">Columns</font>

**Membership**

In [76]:
popdat = {'state': ['Arizona','Arizona','Arizona','Virginia','Virginia'],
          'year': [2005, 2010, 2015, 2010, 2015],
          'pop': [5.9, 6.6, 6.8, 7.9, 8.3]}
popdf = DataFrame(popdat)
popdf

      state  year  pop
0   Arizona  2005  5.9
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9
4  Virginia  2015  8.3

In [77]:
'debt' in popdf.columns

False

**Each column is a Series**

**Column can be referenced by using column name as index into dataframe**

In [78]:
print(popdf['state'])
print(popdf['state'].name)
print(popdf['state'].values)
print(popdf['state'].index)

0     Arizona
1     Arizona
2     Arizona
3    Virginia
4    Virginia
Name: state, dtype: object
state
['Arizona' 'Arizona' 'Arizona' 'Virginia' 'Virginia']
RangeIndex(start=0, stop=5, step=1)

**Alternatively, a column can be referenced as an attribute of the dataframe**

In [79]:
popdf.state

0     Arizona
1     Arizona
2     Arizona
3    Virginia
4    Virginia
Name: state, dtype: object

**Can get at a subset of columns with list, similar to rows of ndarray or index of Series**

In [80]:
popdf[['state','pop']]

      state  pop
0   Arizona  5.9
1   Arizona  6.6
2   Arizona  6.8
3  Virginia  7.9
4  Virginia  8.3

**Changing column names**

In [81]:
popdf

      state  year  pop
0   Arizona  2005  5.9
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9
4  Virginia  2015  8.3

In [82]:
popdf.columns = ['year','state','pop']
popdf

       year  state  pop
0   Arizona   2005  5.9
1   Arizona   2010  6.6
2   Arizona   2015  6.8
3  Virginia   2010  7.9
4  Virginia   2015  8.3

<font color="red">**Warning: Changing column names assigns new names, does NOT rearrange!**</font>

In [83]:
# restore to original
popdf.columns = ['state','year','pop']
popdf

      state  year  pop
0   Arizona  2005  5.9
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9
4  Virginia  2015  8.3

---

#### <font color="brown">Indexing and Manipulating rows and columns</font>

**Row indexing by position, using loc**

In [84]:
popdf.loc[1]

state    Arizona
year        2010
pop          6.6
Name: 1, dtype: object

**Row of a DataFrame is a Series**

In [85]:
print(popdf.loc[1].name)
print(popdf.loc[1].values)

1
['Arizona' 2010 6.6]

**Range of rows**

In [86]:
popdf.loc[1:3]

      state  year  pop
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9

**<font color="red">Note above, end value of range of rows is INCLUSIVE!</font>**

**Subset of rows, subset of columns**

In [87]:
popdf.loc[[0,2],['state','pop']]

     state  pop
0  Arizona  5.9
2  Arizona  6.8

**Adding a column**

In [88]:
# assign same value to all rows in the column
popdf['debt'] = 1.5
popdf

      state  year  pop  debt
0   Arizona  2005  5.9   1.5
1   Arizona  2010  6.6   1.5
2   Arizona  2015  6.8   1.5
3  Virginia  2010  7.9   1.5
4  Virginia  2015  8.3   1.5

In [89]:
# Assign different value for each row
popdf['debt'] = np.arange(1,6)
popdf

      state  year  pop  debt
0   Arizona  2005  5.9     1
1   Arizona  2010  6.6     2
2   Arizona  2015  6.8     3
3  Virginia  2010  7.9     4
4  Virginia  2015  8.3     5

In [90]:
popdat2 = {'Arizona': {2005: 5.9, 2010: 6.6, 2015: 6.8},
           'Virginia': {2010: 7.9, 2015: 8.3}}
popdf2 = DataFrame(popdat2)
popdf2

      Arizona  Virginia
2005      5.9       NaN
2010      6.6       7.9
2015      6.8       8.3

In [91]:
# Different value for each row
popdf2['NJ'] = [8.2, 8.4, 8.6]
popdf2

      Arizona  Virginia   NJ
2005      5.9       NaN  8.2
2010      6.6       7.9  8.4
2015      6.8       8.3  8.6

**What if assigned values fewer than number of rows**

In [92]:
debts = Series([1.2, 1.5, 1.7])
popdf['debt'] = debts
popdf

      state  year  pop  debt
0   Arizona  2005  5.9   1.2
1   Arizona  2010  6.6   1.5
2   Arizona  2015  6.8   1.7
3  Virginia  2010  7.9   NaN
4  Virginia  2015  8.3   NaN

**NaNs are used to pad insufficient number of values for column**

**Creating a new column with values as a function of the other columns**

In [93]:
rand2d = np.random.random((3,2))
randdf = DataFrame(rand2d)
randdf

          0         1
0  0.156333  0.082729
1  0.127780  0.243626
2  0.972524  0.023105

In [98]:
randdf.index = ['one', 'two', 'three']
randdf.columns = ['first', 'second']
randdf

ValueError: Length mismatch: Expected axis has 3 elements, new values have 2 elements

In [ ]:
randdf['third'] = randdf['first'] > randdf['second']
randdf

**Row (index) membership**

In [ ]:
'three' in randdf.index

In [ ]:
randdf['three']

**<font color="red">Above syntax of dataframe['name'] can only be used with column names</font>**

**Row indexing by labels, using loc**

In [99]:
randdf.loc['two']

first      0.12778
second    0.243626
third        False
Name: two, dtype: object

In [100]:
randdf.loc['two':'three']

          first    second  third
two    0.127780  0.243626  False
three  0.972524  0.023105   True

In [101]:
randdf.loc[1:2]

TypeError: cannot do slice indexing on Index with these indexers [1] of type int

**<font color="red">Can't use numeric indexes here because dataframe is indexed by string labels**

---

**Adding a row using loc**

In [ ]:
popdf2

In [ ]:
popdf2.loc[2020] = [7.2, 8.6, 8.9]
popdf2

In [ ]:
popdf2.loc[[2010,2020]]

**Deleting a column with del operation**

In [ ]:
popdf

In [ ]:
del popdf['debt']
popdf

In [ ]:
randdf

In [ ]:
del randdf['second']
randdf

---

#### <font color="brown">Indexing a DataFrame with iloc (using integer indices)</font>

In [ ]:
popdf

In [ ]:
popdf.loc[1]

In [ ]:
popdf.loc[1,'year']

**Using iloc**

In [ ]:
popdf.iloc[1,0]   # use index for rows and columns

In [ ]:
popdf.iloc[1:4]   # slice rows

In [ ]:
popdf.iloc[[1,2,3]]  # list of row indexes

In [ ]:
popdf.iloc[:,'state']

**<font color="red">With iloc you can only use integer indexes for rows and columns</font>**

In [ ]:
popdf.iloc[:,0]

*same as*

In [ ]:
popdf['state']

In [ ]:
popdf2

In [ ]:
popdf2.iloc[2:,[0,2]]

---

#### <font color="brown">Creating a DataFrame from a CSV file (typical usage)</font>

**Using the Pandas method read_csv**

In [102]:
mpgfile = open("auto_mpg_original.csv")
mpgs = pd.read_csv(mpgfile)
mpgs

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8.0,307.0,130.0,3504.0,12.0,70.0,1.0,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693.0,11.5,70.0,1.0,buick skylark 320
2,18.0,8.0,318.0,150.0,3436.0,11.0,70.0,1.0,plymouth satellite
3,16.0,8.0,304.0,150.0,3433.0,12.0,70.0,1.0,amc rebel sst
4,17.0,8.0,302.0,140.0,3449.0,10.5,70.0,1.0,ford torino
...,...,...,...,...,...,...,...,...,...
401,27.0,4.0,140.0,86.0,2790.0,15.6,82.0,1.0,ford mustang gl
402,44.0,4.0,97.0,52.0,2130.0,24.6,82.0,2.0,vw pickup
403,32.0,4.0,135.0,84.0,2295.0,11.6,82.0,1.0,dodge rampage
404,28.0,4.0,120.0,79.0,2625.0,18.6,82.0,1.0,ford ranger
405,31.0,4.0,119.0,82.0,2720.0,19.4,82.0,1.0,chevy s-10

In [103]:
mpgs.shape

(406, 9)

**Note: NAs are read in as NaN which is basically a missing/null value.**

In [104]:
# first 15 rows
mpgs.head(15)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8.0,307.0,130.0,3504.0,12.0,70.0,1.0,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693.0,11.5,70.0,1.0,buick skylark 320
2,18.0,8.0,318.0,150.0,3436.0,11.0,70.0,1.0,plymouth satellite
3,16.0,8.0,304.0,150.0,3433.0,12.0,70.0,1.0,amc rebel sst
4,17.0,8.0,302.0,140.0,3449.0,10.5,70.0,1.0,ford torino
5,15.0,8.0,429.0,198.0,4341.0,10.0,70.0,1.0,ford galaxie 500
6,14.0,8.0,454.0,220.0,4354.0,9.0,70.0,1.0,chevrolet impala
7,14.0,8.0,440.0,215.0,4312.0,8.5,70.0,1.0,plymouth fury iii
8,14.0,8.0,455.0,225.0,4425.0,10.0,70.0,1.0,pontiac catalina
9,15.0,8.0,390.0,190.0,3850.0,8.5,70.0,1.0,amc ambassador dpl
10,NaN,4.0,133.0,115.0,3090.0,17.5,70.0,2.0,citroen ds-21 pallas
11,NaN,8.0,350.0,165.0,4142.0,11.5,70.0,1.0,chevrolet chevelle concours (sw)
12,NaN,8.0,351.0,153.0,4034.0,11.0,70.0,1.0,ford torino (sw)
13,NaN,8.0,383.0,175.0,4166.0,10.5,70.0,1.0,plymouth satellite (sw)
14,NaN,8.0,360.0,175.0,3850.0,11.0,70.0,1.0,amc rebel sst (sw)

**Metadata - descriptive information - of dataframe**

In [105]:
mpgs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406 entries, 0 to 405
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     406 non-null    float64
 2   displacement  406 non-null    float64
 3   horsepower    400 non-null    float64
 4   weight        406 non-null    float64
 5   acceleration  406 non-null    float64
 6   model year    406 non-null    float64
 7   origin        406 non-null    float64
 8   car name      406 non-null    object
dtypes: float64(8), object(1)
memory usage: 28.7+ KB

**In the info above, note that each column now has an inferred datatype, not object.<br>
Also note the number of non-null values per column For instance, mpg has 8 missing values, and horsepower has 6 missing values.**

##### <font color="brown">Get all rows for which mpg column has a null value</font>

In [106]:
mpgs[mpgs['mpg'].isnull()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
10,NaN,4.0,133.0,115.0,3090.0,17.5,70.0,2.0,citroen ds-21 pallas
11,NaN,8.0,350.0,165.0,4142.0,11.5,70.0,1.0,chevrolet chevelle concours (sw)
12,NaN,8.0,351.0,153.0,4034.0,11.0,70.0,1.0,ford torino (sw)
13,NaN,8.0,383.0,175.0,4166.0,10.5,70.0,1.0,plymouth satellite (sw)
14,NaN,8.0,360.0,175.0,3850.0,11.0,70.0,1.0,amc rebel sst (sw)
17,NaN,8.0,302.0,140.0,3353.0,8.0,70.0,1.0,ford mustang boss 302
39,NaN,4.0,97.0,48.0,1978.0,20.0,71.0,2.0,volkswagen super beetle 117
367,NaN,4.0,121.0,110.0,2800.0,15.4,81.0,2.0,saab 900s

##### <font color="brown">Get all rows for which horsepower column has a null value</font>

In [107]:
mpgs[mpgs['horsepower'].isnull()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
38,25.0,4.0,98.0,NaN,2046.0,19.0,71.0,1.0,ford pinto
133,21.0,6.0,200.0,NaN,2875.0,17.0,74.0,1.0,ford maverick
337,40.9,4.0,85.0,NaN,1835.0,17.3,80.0,2.0,renault lecar deluxe
343,23.6,4.0,140.0,NaN,2905.0,14.3,80.0,1.0,ford mustang cobra
361,34.5,4.0,100.0,NaN,2320.0,15.8,81.0,2.0,renault 18i
382,23.0,4.0,151.0,NaN,3035.0,20.5,82.0,1.0,amc concord dl

##### <font color="brown">Get summary starts for numeric columns</font>
**describe** method

In [108]:
mpgs.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin
count,398.000000,406.000000,406.000000,400.000000,406.000000,406.000000,406.000000,406.000000
mean,23.514573,5.475369,194.779557,105.082500,2979.413793,15.519704,75.921182,1.568966
std,7.815984,1.712160,104.922458,38.768779,847.004328,2.803359,3.748737,0.797479
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,105.000000,75.750000,2226.500000,13.700000,73.000000,1.000000
50%,23.000000,4.000000,151.000000,95.000000,2822.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,302.000000,130.000000,3618.250000,17.175000,79.000000,2.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,3.000000

---

#### <font color="brown">Numpy ufuncs work with DataFrames</font>

In [109]:
df = DataFrame(np.random.randn(4,3),columns=list("ABC"),index=["One","Two","Three",'Four'])
df

              A         B         C
One    0.343553 -1.099325 -0.732156
Two    0.047799  0.636356  1.063954
Three  0.390229 -0.772457  1.531668
Four   0.713012 -1.966233  1.585386

In [110]:
np.abs(df)

              A         B         C
One    0.343553  1.099325  0.732156
Two    0.047799  0.636356  1.063954
Three  0.390229  0.772457  1.531668
Four   0.713012  1.966233  1.585386

In [111]:
df  # is original changed?

              A         B         C
One    0.343553 -1.099325 -0.732156
Two    0.047799  0.636356  1.063954
Three  0.390229 -0.772457  1.531668
Four   0.713012 -1.966233  1.585386

**Original is not changed**

**Alternatively can use dataframe method abs(), this won't change original df either**

In [112]:
df.abs()

              A         B         C
One    0.343553  1.099325  0.732156
Two    0.047799  0.636356  1.063954
Three  0.390229  0.772457  1.531668
Four   0.713012  1.966233  1.585386

In [113]:
df

              A         B         C
One    0.343553 -1.099325 -0.732156
Two    0.047799  0.636356  1.063954
Three  0.390229 -0.772457  1.531668
Four   0.713012 -1.966233  1.585386

**Assign to effect the change**

In [114]:
dfabs = df.abs()
dfabs

              A         B         C
One    0.343553  1.099325  0.732156
Two    0.047799  0.636356  1.063954
Three  0.390229  0.772457  1.531668
Four   0.713012  1.966233  1.585386

In [115]:
dfabs.mean()

A    0.373648
B    1.118593
C    1.228291
dtype: float64

**<font color="red">Note: default axis is 0, so above gets column means</font>**

In [116]:
dfabs.mean(axis=1)  # row means

One      0.725011
Two      0.582703
Three    0.898118
Four     1.421544
dtype: float64

In [117]:
dfabs.cumsum(axis=1)   # cumulative sums of rows

              A         B         C
One    0.343553  1.442878  2.175034
Two    0.047799  0.684154  1.748109
Three  0.390229  1.162685  2.694353
Four   0.713012  2.679245  4.264631

In [118]:
dfabs.sum()     # sum of each column

A    1.494593
B    4.474371
C    4.913164
dtype: float64

##### **What if there are NaN values?**

In [119]:
dfabs2 = dfabs.copy()
dfabs2

              A         B         C
One    0.343553  1.099325  0.732156
Two    0.047799  0.636356  1.063954
Three  0.390229  0.772457  1.531668
Four   0.713012  1.966233  1.585386

In [120]:
dfabs2.iloc[1,1] = np.nan
dfabs2

              A         B         C
One    0.343553  1.099325  0.732156
Two    0.047799       NaN  1.063954
Three  0.390229  0.772457  1.531668
Four   0.713012  1.966233  1.585386

In [121]:
dfabs2['B'].sum()

3.8380147683820196

**NaNs are skipped when summing**<br>
**But they can be considered if needed, with skipna parameter set to False**

In [122]:
dfabs2.mean(skipna=False)

A    0.373648
B         NaN
C    1.228291
dtype: float64

In [123]:
dfabs

              A         B         C
One    0.343553  1.099325  0.732156
Two    0.047799  0.636356  1.063954
Three  0.390229  0.772457  1.531668
Four   0.713012  1.966233  1.585386

In [124]:
dfabs['C'].argmax()

3

In [125]:
dfabs.loc['Three'].argmax()

2